tsung/load-test-preferences.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="20" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="20" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="20" unit="second">
      <users arrivalrate="6" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="20" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="20" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="25" unit="second">
      <users arrivalrate="12" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="contracts" probability="100" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="id" />
      </setdynvars>

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url='/users/sign_in' version='1.1' method='POST'
          content_type='application/x-www-form-urlencoded'
          contents='user%5Bemail%5D=email%%_id%%@bsms.com&amp;user%5Bpassword%5D=seedaccount'
          ></http>
      </request>

      <for from="1" to="5" incr="1" var="counter">
        <thinktime value="1" random="true"/>
        <setdynvars sourcetype="random_number" start="1" end="5000">
          <var name="listing_id" />
        </setdynvars>
        <request subst="true">
          <http url='/listing/request/new?listing_id=%%_listing_id%%'
            version='1.1'
            method='GET'
            ></http>
        </request>
        <request subst="true">
          <http url='/listing/request/new'
            version='1.1'
            method='POST'
            content_type='application/x-www-form-urlencoded'
            contents='listing_request%5Brequest_message%5D=message&amp;listing_request%5Blisting_id%5D=%%_listing_id%%&amp;listing_request%5Bsubleaser_id%5D=%%_id%%&amp;commit=Submit'
            ></http>
        </request>
      </for>

      <thinktime value="2" random="true"/>

      <request>
        <http url='/listing/request/show_requests_to_me' version='1.1' method='GET'></http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url='/users/sign_out' version='1.1' method='DELETE'></http>
      </request>

    </session>
  </sessions>
</tsung>